In [3]:
#Konversi Nilai Numerik Kedalam Kategori
#LeonyCornelia-2373002

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

In [8]:
#Persiapan Data Frame
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size = (n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    70
1    78
2    17
3    16
4    60
5    50
6    23
7    22
8    11
9    48

In [10]:
#Pengelompokkan Nilai Numerik Kedalam Beberapa Kategori Menggunakan Cut ()
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins = [0, 18, 65, 99], 
                             labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    70        manula
1    78        manula
2    17          anak
3    16          anak
4    60        dewasa
5    50        dewasa
6    23        dewasa
7    22        dewasa
8    11          anak
9    48        dewasa